# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
brew 'vim'
brew 'nmap'
brew 'git'
brew 'git-lfs'
brew 'p7zip'
brew 'ssh-copy-id'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'
brew 'bash-completion2'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'grep'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'wget'
brew 'hh'
brew 'yank'
brew 'peco'
brew 'byobu'
brew 'fish'
brew 'lnav'
brew 'fasd'
brew 'tig'

# Apps
#cask 'docker'
#cask 'firefox'
#cask 'google-backup-and-sync'
#cask 'google-chrome'
cask 'iterm2'
#cask 'java'
#cask 'mysqlworkbench'
#cask 'slack'
#cask 'sublime-text'
#cask 'vagrant'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'font-hack-nerd-font'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
